# Assignment - 1

In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("https://raw.githubusercontent.com//justmarkham//DAT8//master//data//u.user",sep="|", index_col="user_id")
data

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

# Q.1 See the first 10 and last 10 entries

In [7]:
print("--------------------------------First 10 Entery---------------------------------------")
print(data.head(10))
print("--------------------------------Last 10 Entery---------------------------------------")
print(data.tail(10))

--------------------------------First 10 Entery---------------------------------------
         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
--------------------------------Last 10 Entery---------------------------------------
         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

# 2. What is the number of observations in the dataset

In [13]:
l=len(data)
print("No. of Obesevation :",l)

No. of Obesevation : 943

In [15]:
d=data.shape[0]
print("No. Of Observation :", d)

No. Of Observation : 943

# 3. What is the number of columns in the dataset?

In [18]:
c=data.shape[1]
print("No. Of Columns :",c)

No. Of Columns : 4

# 3. Print the name of all the columns

In [22]:
data.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

# 4. What is the data type of each column?

In [54]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

# 5. Print only the occupation column

In [27]:
d=data[["occupation"]]
print(d)

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

In [44]:
u=data["occupation"].unique
print(u)

<bound method Series.unique of user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object>

# 6. How many different occupations are in this dataset?

In [42]:
n_u=data["occupation"].nunique()
print(n_u)

21

# 7. What is the most frequent occupation?

In [52]:
m=data["occupation"].value_counts().idxmax()
print(m)

student

# 8. DataFrame Info.

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 69.1+ KB

# 9. Describe all the columns

In [55]:
data.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

# 10. Summarize only the occupation column

In [56]:
data[['occupation']].value_counts()

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
dtype: int64

# 11. What is the mean age of users?

In [65]:
data['age'].mean()

34.05196182396607

In [64]:
data[['age']].mean()

age    34.051962
dtype: float64

# 12. What is the age with least occurrence?

In [67]:
data['age'].min()

7